
## :x: Apply Failed (sakuracloud/environments/production)

[CI link](https://github.com/FlutterKaigi/2025/actions/runs/19105825427)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.random_password.random_password.container_registry_password: Refreshing state... [id=none]
module.container_registry.sakuracloud_container_registry.registry: Refreshing state... [id=113702585415]
module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-fcm-internal-api: Refreshing state... [id=a0be7867-afaa-441a-9488-09302827d662]
module.docker.docker_image.bff: Refreshing state... [id=sha256:6bb1ee9effbf90d738dd970d0e3ddd6242926f625f1fdee59845bac7a78bcb53flutterkaigi-2025-production2r4j.sakuracr.jp/bff:latest]
module.docker.docker_image.fcm-internal-api[0]: Refreshing state... [id=sha256:e8dea5b7fe1c184808da47bd834455eee3ee00644686e6fc5b0c2f9273ebd7cdflutterkaigi-2025-production2r4j.sakuracr.jp/fcm-internal-api:latest]
module.docker.docker_registry_image.bff: Refreshing state... [id=sha256:23b6b35c040a0a9732578be96492cdc395577e60052459b5b38b960c037e503c]
module.docker.docker_registry_image.fcm-internal-api[0]: Refreshing state... [id=sha256:f9cbf94e6c895fdd73b91d001a5b092a28fb11d024c91124ab1e3bd296e2d599]
module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-bff: Refreshing state... [id=240a1e61-1a2f-4853-a7e7-9742c9861d77]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker.docker_image.bff has been deleted
  - resource "docker_image" "bff" {
        id           = "sha256:6bb1ee9effbf90d738dd970d0e3ddd6242926f625f1fdee59845bac7a78bcb53flutterkaigi-2025-production2r4j.sakuracr.jp/bff:latest"
      - image_id     = "sha256:6bb1ee9effbf90d738dd970d0e3ddd6242926f625f1fdee59845bac7a78bcb53" -> null
        name         = "flutterkaigi-2025-production2r4j.sakuracr.jp/bff:latest"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker.docker_image.fcm-internal-api[0] has been deleted
  - resource "docker_image" "fcm-internal-api" {
        id           = "sha256:e8dea5b7fe1c184808da47bd834455eee3ee00644686e6fc5b0c2f9273ebd7cdflutterkaigi-2025-production2r4j.sakuracr.jp/fcm-internal-api:latest"
      - image_id     = "sha256:e8dea5b7fe1c184808da47bd834455eee3ee00644686e6fc5b0c2f9273ebd7cd" -> null
        name         = "flutterkaigi-2025-production2r4j.sakuracr.jp/fcm-internal-api:latest"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-bff will be updated in-place
  ~ resource "sakuracloud_apprun_application" "flutterkaigi-2025-bff" {
        id              = "240a1e61-1a2f-4853-a7e7-9742c9861d77"
        name            = "flutterkaigi-2025-production-2r4j"
        # (6 unchanged attributes hidden)

      ~ components {
            name       = "production"
            # (2 unchanged attributes hidden)

          - env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          - env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          - env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

            # (14 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.docker.docker_image.bff will be created
  + resource "docker_image" "bff" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "flutterkaigi-2025-production2r4j.sakuracr.jp/bff:latest"
      + platform     = "linux/amd64"
      + repo_digest  = (known after apply)
      + triggers     = (known after apply)

      + build {
          + cache_from     = []
          + context        = "../../modules/docker/../../../../"
          + dockerfile     = "../../modules/docker/../../../..//bff/engine/Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.docker.docker_image.fcm-internal-api[0] will be created
  + resource "docker_image" "fcm-internal-api" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "flutterkaigi-2025-production2r4j.sakuracr.jp/fcm-internal-api:latest"
      + platform     = "linux/amd64"
      + repo_digest  = (known after apply)
      + triggers     = (known after apply)

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.docker.docker_registry_image.bff must be replaced
-/+ resource "docker_registry_image" "bff" {
      ~ id                   = "sha256:23b6b35c040a0a9732578be96492cdc395577e60052459b5b38b960c037e503c" -> (known after apply)
        name                 = "flutterkaigi-2025-production2r4j.sakuracr.jp/bff"
      ~ sha256_digest        = "sha256:23b6b35c040a0a9732578be96492cdc395577e60052459b5b38b960c037e503c" -> (known after apply)
      ~ triggers             = {
          - "image_id" = "sha256:6bb1ee9effbf90d738dd970d0e3ddd6242926f625f1fdee59845bac7a78bcb53"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.docker.docker_registry_image.fcm-internal-api[0] must be replaced
-/+ resource "docker_registry_image" "fcm-internal-api" {
      ~ id                   = "sha256:f9cbf94e6c895fdd73b91d001a5b092a28fb11d024c91124ab1e3bd296e2d599" -> (known after apply)
        name                 = "flutterkaigi-2025-production2r4j.sakuracr.jp/fcm-internal-api"
      ~ sha256_digest        = "sha256:f9cbf94e6c895fdd73b91d001a5b092a28fb11d024c91124ab1e3bd296e2d599" -> (known after apply)
      ~ triggers             = {
          - "image_id" = "sha256:e8dea5b7fe1c184808da47bd834455eee3ee00644686e6fc5b0c2f9273ebd7cd"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 2 to destroy.
╷
│ Error: could not read SakuraCloud Apprun Application[a0be7867-afaa-441a-9488-09302827d662]: code: 404, message: Not Found, inner_error: {domain: global, reason: not found, message: Application Not Found, location_type: parameter, location: }
│ 
│   with module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-fcm-internal-api,
│   on ../../modules/apprun/fcm-internal-api.tf line 1, in resource "sakuracloud_apprun_application" "flutterkaigi-2025-fcm-internal-api":
│    1: resource "sakuracloud_apprun_application" "flutterkaigi-2025-fcm-internal-api" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":561,"Program":"tfcmt","SHA1":"54bb53bbdba9508ffd9387cd033365545e1f56ef","Target":"sakuracloud/environments/production","Vars":{},"WorkflowName":"Terraform Apply"} -->